In [1]:
import pandas as pd
import numpy as np

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10 ,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [4]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [5]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

## Index alignment in Series

In [6]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [13]:
population / area
# np.NaN

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [11]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [10]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

## set default filling values

In [11]:
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

## Index alignment in DataFrame

In [16]:
'|'.join(['eee', 'fff'])

'eee|fff'

In [22]:
' '.join(['eee', 'fff'])
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB')) # list : str to list ; .join: list to str
A

    A   B
0  19   2
1   4  18

In [23]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  6  4  8
1  6  1  3
2  8  1  9

In [26]:
A+B

      A     B   C
0  23.0   8.0 NaN
1   5.0  24.0 NaN
2   NaN   NaN NaN

In [24]:
fill = A.stack().mean()
fill

10.75

In [25]:
A.add(B, fill_value=fill)

       A      B      C
0  23.00   8.00  18.75
1   5.00  24.00  13.75
2  11.75  18.75  19.75

In [45]:
print('try format is {0}, {1}'.format('zero', 'first'))
x = .222222
print('print %0.1f' %x)
name = 'Lucy'
print('print %s' %name)

try format is zero, first
print 0.2
print Lucy

## broadcasting in DataFrame

In [27]:
A = rng.randint(10, size = (3, 4))
df = pd.DataFrame(A, columns = list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -5 -3  3  1
2 -8 -6 -3  6

In [62]:
df['R']

0    9
1    6
2    3
Name: R, dtype: int64

In [63]:
df

   Q  R  S  T
0  8  9  4  1
1  3  6  7  2
2  0  3  1  7

In [37]:
df.T - df['R']

   0  1  2
Q  7  5 -1
R  0  0  0
S  8 -3 -5
T  7 -1 -7

In [64]:
halfrow = df.iloc[0, ::2]
halfrow

Q    8
S    4
Name: 0, dtype: int64

In [65]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -5.0 NaN  3.0 NaN
2 -8.0 NaN -3.0 NaN

In [43]:
ha = df.loc[1, :]

In [44]:
ha

Q    9
R    4
S    1
T    3
Name: 1, dtype: int64

In [45]:
df - ha

   Q  R  S  T
0 -1 -3  8  5
1  0  0  0  0
2 -3  3  1 -3

In [46]:
df

   Q  R  S  T
0  8  1  9  8
1  9  4  1  3
2  6  7  2  0